# MLOps Task.

[смотри диаграмму]

## MLOps lifecycle:

**1.	Data / Данные.**

_Data Engineer (DE)_ работает с «сырыми» данными (raw data): 
- формирует атрибуты/признаки (features);
- чистит данные;
- маркирует данные;
- подготавливает данные к построению ML модели.

**2.	Development / Разработка, Создание.**

_Data Scientist:_
- анализирует и трансформирует данные, полученные от DE;
- строит модель;
- тренерует модель;
- оценивает модель (метрики, качество, работоспособность, ответ/predictions);
- отправляет модель на развёртывание/deployment.

**3.	Production / Производство.**

_Dev/MLOps:_
- принимает готовую модель на развёртывание;
- мониторит работу и надёжность модели, качество ответов/predictions;
- отправляет модель на перетренеровку в Development.

## Шаги / Steps:
1.	Data Engineer обработал «сырые» данные и отправил их к Data Scientist.
2.	Data Scientist посмотрел на присланные данные, нашёл ошибки, исправил их, сделал предварительный анализ данных, трансформировал данные до нужного формата. Затем построил и натренеровал модель, оценил её продуктивность и метрики. Отправил модель на deployment/развёртывание к Dev/MLOps.
3.	Dev/MLOps принял модель на развёртывание и стал наблюдать как она работает. Со временем большинство моделей теряют свою продуктивность, точность ответов/predictions начинает снижаться. Задача Dev/MLOps вовремя заметить паттерн деградации модели и отправить её на перетренеровку/retraining на стадию Development. 
4.	Model Retraining нужен для обновления устаревшей модели. Обновляться могут данные, алгоритмы и гиперпараметры модели. Далее, модель повторяет все шаги: Model Deployment, Production….и так далее по кругу.
5.	Когда модель попадает в Production, то её Business value оценивает Business Analyst. Он работает с полученными ответами/predictions, на их основе строит отчеты.

